Model: "Generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input (InputLayer)           (None, 14, 28)            0         
_________________________________________________________________
1st (Dense)                  (None, 14, 1024)          29696     
_________________________________________________________________
2nd (Dense)                  (None, 14, 512)           524800    
_________________________________________________________________
3rd (Dense)                  (None, 14, 256)           131328    
_________________________________________________________________
4th (Dense)                  (None, 14, 512)           131584    
_________________________________________________________________
5th (Dense)                  (None, 14, 28)            14364     
=================================================================
Total params: 831,772
Trainable params: 831,772
Non-trainable params: 0
_________________________________________________________________
